(BLUE+NIR)/(RED+SWIR3)


FireBeetle ESP-32
          Rx | Tx
Serial2 = 16 | 17
Serial1 =  9 | 10
Serial0 =  3 | 1

LoRa:STOP GPS
LoRa:START GPS
LoRa:TIME_UPDATE:1
LoRa:Test



float dummy_cyclic_coordinates[][2] = {
    {54.214176, 69.511151},
    {54.213195, 69.511303},
    {54.212246, 69.511400},
    {54.211856, 69.512168},
    {54.212011, 69.512357},
    {54.212327, 69.512357},
    {54.212580, 69.512519},
};


float dummy_cyclic_coordinates[][2] = {
    {54.213928, 69.510647},
    {54.212635, 69.511317},
    {54.211820, 69.512135},
    {54.212000, 69.512202},
    {54.212556, 69.512497},
    {54.213528, 69.513394},
    {54.214633, 69.514386},
};


latitude = dummy_coordinates[counter][0]; longitude = dummy_coordinates[counter][1];
latitude = dummy_coordinates[cowId][0]; longitude = dummy_coordinates[cowId][1];



+-----------------+-------------+----------+------------+-----------+
|   Target Column |   Precision |   Recall |   F1-Score |   Support |
+=================+=============+==========+============+===========+
|               0 |           1 |        1 |          1 |     74088 |
+-----------------+-------------+----------+------------+-----------+
|               1 |           1 |        1 |          1 |     74088 |
+-----------------+-------------+----------+------------+-----------+
|               2 |           1 |        1 |          1 |     74088 |
+-----------------+-------------+----------+------------+-----------+
|               3 |           1 |        1 |          1 |     74088 |
+-----------------+-------------+----------+------------+-----------+
|               4 |           1 |        1 |          1 |     74088 |
+-----------------+-------------+----------+------------+-----------+
|               5 |           1 |        1 |          1 |     74088 |
+-----------------+-------------+----------+------------+-----------+
|               6 |           1 |        1 |          1 |     74088 |
+-----------------+-------------+----------+------------+-----------+
|               7 |           1 |        1 |          1 |     74088 |
+-----------------+-------------+----------+------------+-----------+



uint8_t cfg_rxm_disable_power_save[] = {
    0xB5, 0x62, // UBX Sync characters
    0x06, 0x11, // CFG-RXM message class and message id
    0x08, 0x00, // Payload length
    0x00, 0x00, // Flags (disable power save mode)
    0x01, 0x00, // Reserved
    0x13, 0x9E  // Checksum (CK_A and CK_B)
};

uint8_t cfg_rxm_disable_continuous[] = {
    0xB5, 0x62, // UBX Sync characters
    0x06, 0x11, // CFG-RXM message class and message id
    0x08, 0x00, // Payload length
    0x00, 0x00, // Flags (disable continuous mode)
    0x01, 0x00, // Reserved
    0x12, 0xA0  // Checksum (CK_A and CK_B)
};

uint8_t cfg_rxm_enable_power_save[] = {
    0xB5, 0x62, // UBX Sync characters
    0x06, 0x11, // CFG-RXM message class and message id
    0x08, 0x00, // Payload length
    0x01, 0x00, // Flags (enable power save mode)
    0x01, 0x00, // Reserved
    0x13, 0x9F  // Checksum (CK_A and CK_B)
};

uint8_t cfg_rxm_enable_continuous[] = {
    0xB5, 0x62, // UBX Sync characters
    0x06, 0x11, // CFG-RXM message class and message id
    0x08, 0x00, // Payload length
    0x02, 0x00, // Flags (enable continuous mode)
    0x01, 0x00, // Reserved
    0x14, 0xA1  // Checksum (CK_A and CK_B)
};

# Receiver
e32ttl.setMode(MODE_2_POWER_SAVING);
configuration.OPTION.wirelessWakeupTime = WAKE_UP_250;

# Sender
e32ttl.setMode(MODE_1_WAKE_UP);
configuration.OPTION.wirelessWakeupTime = WAKE_UP_2000;


Содержание

1. Аналитическй обзор научно-технической информации по существующим проблемам и путей из решения в секторе цифрового управления пастбищеоборотом
1.1 Анализ текущего состояния и перспективы создания  интелектуальных систем кортроля выпаса КРС и контроля ресурса пастбища
1.2 Применение технологии дистанционного зондирования земли для оценки биомассы пастбища
1.3 Технические решения для рационального использования ресурсов пастбища
1.4 Выводы

2. Разработка модели(системы) по контролю состояния пастбища
2.1 Сбор и анализ снимков ДЗЗ
2.2 Разработка методики оценки ресурса пастбища с помощю даннных дистанционного зондирования земли
2.3 Разработка интеллектуальной платформы для оценки состояния пастбища
2.4 Выводы

3. Разработка конструкции и системы управления автоматическими воротами
3.1 Разработка конструкции автоматических ворот
3.2 Разработка системы управления автоматическими воротами
3.3 Разработка схемных решении по управлению
3.4 Выводы

4. Проведение экспериментальных исследовании и корректировка системы(комплекса)
4.1 Отладка по работе геопортала
4.2 Наладка технических средств и оценка работы автоматических ворот
4.3 Экспериментальные исследования по работе комплекса в целом. Оценка результатов
4.4 Выводы

Заключение

